src/Reports/АнализРаспределенияПроизводственныхЗатрат/АнализРаспределенияПроизводственныхЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализРаспределенияПроизводственныхЗатрат</name>
  <comment>(Регл)</comment>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТолькоРасхождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНаработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>АнализироватьПрошлыйПериодНакопленияСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетТоваровОрганизацийВРазрезеСкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДетализацияКосвенныхЗатратВСебестоимости</name>
    <type>
      <types>EnumRef.ДетализацияКосвенныхЗатратВСебестоимости</types>
    </type>
  </resources>
  <resources>
    <name>ДиректКостингОбщепроизводственныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДиректКостингАдминистративныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьИтерационныйРасчетЗатратВстречногоВыпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНакопительныеСкидкиПоДисконтнымКартам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкиПоВидуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкиПоДисконтнойКарте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкиПоКоличествуТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкиПоСуммеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкиПоСуммеТовараДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеВключатьНДСВЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеВключатьНДСВСтоимостьПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрABCКлассификацииПокупателей</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ПараметрыABCКлассификацииПокупателей</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрРаспределенияПокупателейПоСтадиямВзаимоотношений</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ПараметрыРаспределенияПокупателейПоСтадиямВзаимоотношений</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРасчетаНакопленияСкидок</name>
    <type>
      <types>EnumRef.ПериодичностьНакопленияСкидок</types>
    </type>
  </resources>
  <resources>
    <name>СпособИспользованияНакопительныхСкидок</name>
    <type>
      <types>EnumRef.СпособыИспользованияНакопительныхСкидок</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиМПЗ</name>
    <comment>(Упр) Способ оценки МПЗ</comment>
    <type>
      <types>EnumRef.СпособыОценки</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаСебестоимостиВспомогательногоПроизводства</name>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимостиПродукции</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаСебестоимостиВыпускаПоОперациям</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимостиВыпускаПоОперациям</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаСебестоимостиОсновногоПроизводства</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимостиПродукции</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяАдминистративныеРасходы</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяБракВПроизводстве</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяОбщепроизводственныеРасходы</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>УчетЗатратПоЗаказамНаПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкиПоСуммеНеВСпискеТовараДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/AccumulationRegisters/ЗатратыНаВыпускПродукции/ЗатратыНаВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаВыпускПродукции</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатратыНаВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыВстречногоВыпуска</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КосвенныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппаНЗП</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНЗП</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеНЗП</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗатратыНаВыпускПродукцииНаработка/ЗатратыНаВыпускПродукцииНаработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаВыпускПродукцииНаработка</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатратыНаВыпускПродукции</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппаНЗП</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНЗП</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеНЗП</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/НезавершенноеПроизводство/НезавершенноеПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НезавершенноеПроизводство</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийНезавершенноеПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована списанием партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПередела</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеУчитыватьВРасчетеБазы</name>
    <comment>Если Истина - движение приход не будет учитываться при расчете БазаПриход базы распределения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеУчитыватьДвиженияПриРасчетеСебестоимости</name>
    <comment>Если Истина - движения приход/расход не будет учитываться в запросах при расчете себестоимости выпуска</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ДетализацияКосвенныхЗатратВСебестоимости/ДетализацияКосвенныхЗатратВСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДетализацияКосвенныхЗатратВСебестоимости</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоКаждойСтатьеЗатрат</name>
  </enumValues>
  <enumValues>
    <name>ПоФиксированнойСтатьеЗатрат</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ХарактерЗатрат/ХарактерЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>БракВПроизводстве</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВложенияВоВнеоборотныеАктивы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаСбыт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОбщепроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдминистративныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ТранспортноЗаготовительныеРасходы</name>
  </enumValues>
</mdclass:Enum>

src/Reports/АнализРаспределенияПроизводственныхЗатрат/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Функция заменяет комментарии в тексте запроса в зависимости от отражения в учете.
//
// Параметры
//  ИсходныхТекстЗапроса – Строка – Текст запроса.
//  СтруктураШапкиДокумента – Структура - Реквизиты документа "Расчет себестоимости выпуска".
//
// Возвращаемое значение:
//   Строка – Текст запроса, в котором заменены комментарии.
//
Функция ЗаменитьКомментарииВТекстеЗапроса(ИсходныйТекстЗапроса)
	
	Если ВидУчета = 2 Тогда
		ВидУчета = 1;
	КонецЕсли; 
	
	// Управленческий учет
	Если ВидУчета = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ИсходныйТекстЗапроса, "%СуффиксУчета%", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СуффиксОрганизаций%", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//НеДляНалУчета", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДляУпрУчета", "");
		
	// Бухгалтерский учет	
	ИначеЕсли ВидУчета = 1 Тогда
		ТекстЗапроса = СтрЗаменить(ИсходныйТекстЗапроса, "%СуффиксУчета%", "БухгалтерскийУчет");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СуффиксОрганизаций%", "Организаций");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//НеДляНалУчета", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДляРеглУчета", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДляБухУчета", "");
		
	// Налоговый учет	
	ИначеЕсли ВидУчета = 2 Тогда
		ТекстЗапроса = СтрЗаменить(ИсходныйТекстЗапроса, "%СуффиксУчета%", "НалоговыйУчет");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СуффиксОрганизаций%", "Организаций");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДляРеглУчета", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДляНалУчета", "");

	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции // ЗаменитьКомментарииВТекстеЗапроса()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним) + " "
		+ ?(ВидУчета = 1, "(бухгалтерский учет)",
	   	  ?(ВидУчета = 2, "(налоговый учет)", "(управленческий учет)"));
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;  	
	УниверсальныйОтчет.ИмяРегистра = "";    	
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;  	
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;	
	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Ложь;
	
	// Описание исходного текста запроса.
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	//ДляРеглУчета УчетнаяПолитика.Организация КАК Организация,
	|	УчетнаяПолитика.СтатьяОбщепроизводственныеРасходы КАК СтатьяОбщепроизводственныеРасходы,
	|	//ДляУпрУчета УчетнаяПолитика.СтатьяАдминистративныеРасходы КАК СтатьяАдминистративныеРасходы,
	|	УчетнаяПолитика.СтатьяБракВПроизводстве КАК СтатьяБракВПроизводстве
	|
	|ПОМЕСТИТЬ УчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика%СуффиксОрганизаций%.СрезПоследних(&ДатаКон) КАК УчетнаяПолитика
	|ГДЕ
	|	УчетнаяПолитика.ДетализацияКосвенныхЗатратВСебестоимости = ЗНАЧЕНИЕ(Перечисление.ДетализацияКосвенныхЗатратВСебестоимости.ПоФиксированнойСтатьеЗатрат)
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	//ДляРеглУчета ЗатратыНаВыпускПродукции.Организация,
	|	//ДляРеглУчета ЗатратыНаВыпускПродукции.СчетУчета,
	|	//ДляБухУчета  ЗатратыНаВыпускПродукции.НалоговоеНазначениеПоФакту,
	|	ЗатратыНаВыпускПродукции.СтатьяЗатрат,
	|	ЗатратыНаВыпускПродукции.СтатьяЗатрат.ВидЗатрат КАК ВидЗатрат,
	|	ЗатратыНаВыпускПродукции.Затрата,
	|	ЗатратыНаВыпускПродукции.ХарактеристикаЗатраты,
	|	ЗатратыНаВыпускПродукции.СерияЗатраты,
	|	ЗатратыНаВыпускПродукции.НоменклатурнаяГруппаНЗП КАК НоменклатурнаяГруппа,
	|
	|	ВЫБОР КОГДА ЗатратыНаВыпускПродукции.ПодразделениеНЗП =
	|		//ДляУпрУчета ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		//ДляРеглУчета ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА
	|		ЗатратыНаВыпускПродукции.Подразделение
	|	ИНАЧЕ
	|		ЗатратыНаВыпускПродукции.ПодразделениеНЗП
	|	КОНЕЦ КАК Подразделение,
	|
	|	ЗатратыНаВыпускПродукции.Продукция,
	|	ЗатратыНаВыпускПродукции.ХарактеристикаПродукции,
	|	ЗатратыНаВыпускПродукции.СерияПродукции,
	|	ЗатратыНаВыпускПродукции.Спецификация,
	|	ЗатратыНаВыпускПродукции.ЗаказНЗП КАК Заказ,
	|	ЗатратыНаВыпускПродукции.Регистратор,
	|	ЗатратыНаВыпускПродукции.Количество,
	|	ЗатратыНаВыпускПродукции.Сумма КАК Стоимость,
	|	//ДляБухУчета ЗатратыНаВыпускПродукции.СуммаНУ КАК СтоимостьНУ,	
	|	//ДляБухУчета 0 КАК СтоимостьНУНЗП,	
	|	//ДляБухУчета ЗатратыНаВыпускПродукции.НДСВходящий КАК НДСВходящий,	
	|	//ДляБухУчета 0 КАК НДСВходящийНЗП,
	|	//ДляБухУчета ЗатратыНаВыпускПродукции.НДСКредит КАК НДСКредит,
	|	//ДляБухУчета 0 КАК НДСКредитНЗП,	
	|	0 КАК КоличествоНЗП,
	|	0 КАК СтоимостьНЗП
	|
	|ПОМЕСТИТЬ ПроизводственныеЗатраты
	|ИЗ
	|	РегистрНакопления.ЗатратыНаВыпускПродукции%СуффиксУчета% КАК ЗатратыНаВыпускПродукции
	|ГДЕ
	|	ЗатратыНаВыпускПродукции.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ЗатратыНаВыпускПродукции.Активность
	|	И (НЕ ЗатратыНаВыпускПродукции.КодОперации В (&МассивИсключаемыхКодовОперацийЗатратыНаВыпускПродукции))
	|{ГДЕ
	|	//ДляРеглУчета ЗатратыНаВыпускПродукции.Организация.* КАК Организация,
	|	//ДляРеглУчета ЗатратыНаВыпускПродукции.СчетУчета.* КАК СчетУчета,
    |	//ДляБухУчета ЗатратыНаВыпускПродукции.НалоговоеНазначениеПоФакту.* КАК НалоговоеНазначениеПоФакту,
	|	ЗатратыНаВыпускПродукции.СтатьяЗатрат.* КАК СтатьяЗатрат,
	|	ЗатратыНаВыпускПродукции.Затрата.* КАК Затрата,
	|	ЗатратыНаВыпускПродукции.ХарактеристикаЗатраты.* КАК ХарактеристикаЗатраты,
	|	ЗатратыНаВыпускПродукции.СерияЗатраты.* КАК СерияЗатраты,
	|	ЗатратыНаВыпускПродукции.НоменклатурнаяГруппаНЗП.* КАК НоменклатурнаяГруппа,
	|	Подразделение.* КАК Подразделение,
	|	ЗатратыНаВыпускПродукции.Продукция.* КАК Продукция,
	|	ЗатратыНаВыпускПродукции.ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	|	ЗатратыНаВыпускПродукции.СерияПродукции.* КАК СерияПродукции,
	|	ЗатратыНаВыпускПродукции.Спецификация.* КАК Спецификация,
	|	ЗатратыНаВыпускПродукции.ЗаказНЗП.* КАК Заказ
	|}	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	//ДляРеглУчета ЗатратыНаВыпускПродукцииНаработка.Организация,
	| 	//ДляРеглУчета ЗатратыНаВыпускПродукцииНаработка.СчетУчета КАК СчетУчета,
	| 	//ДляБухУчета  ЗатратыНаВыпускПродукцииНаработка.НалоговоеНазначениеПоФакту КАК НалоговоеНазначениеПоФакту,
	| 	ЗатратыНаВыпускПродукцииНаработка.СтатьяЗатрат,
	| 	ЗатратыНаВыпускПродукцииНаработка.СтатьяЗатрат.ВидЗатрат КАК ВидЗатрат,
	| 	ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.Затрата = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА
	| 		Неопределено
	| 	ИНАЧЕ
	| 		ЗатратыНаВыпускПродукцииНаработка.Затрата
	| 	КОНЕЦ КАК Затрата,
	| 	ЗатратыНаВыпускПродукцииНаработка.ХарактеристикаЗатраты,
	| 	ЗатратыНаВыпускПродукцииНаработка.СерияЗатраты,
	| 	ЗатратыНаВыпускПродукцииНаработка.НоменклатурнаяГруппаНЗП КАК НоменклатурнаяГруппа,
	| 
	| 	ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ПодразделениеНЗП =
	| 		//ДляУпрУчета ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	| 		//ДляРеглУчета ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	| 	ТОГДА
	| 		ЗатратыНаВыпускПродукцииНаработка.Подразделение
	| 	ИНАЧЕ
	| 		ЗатратыНаВыпускПродукцииНаработка.ПодразделениеНЗП
	| 	КОНЕЦ КАК Подразделение,
	| 
	| 	ЗатратыНаВыпускПродукцииНаработка.Продукция,
	| 	ЗатратыНаВыпускПродукцииНаработка.ХарактеристикаПродукции,
	| 	NULL КАК СерияПродукции,
	| 	NULL КАК Спецификация,
	| 	ЗатратыНаВыпускПродукцииНаработка.ЗаказНЗП КАК Заказ,
	| 	ЗатратыНаВыпускПродукцииНаработка.Регистратор,
	| 	ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	| 		ЗатратыНаВыпускПродукцииНаработка.Количество
	| 	ИНАЧЕ
	| 		- ЗатратыНаВыпускПродукцииНаработка.Количество
	| 	КОНЕЦ КАК Количество,
	| 	ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	| 		ЗатратыНаВыпускПродукцииНаработка.Сумма
	| 	ИНАЧЕ
	| 		- ЗатратыНаВыпускПродукцииНаработка.Сумма
	| 	КОНЕЦ КАК Стоимость,
	|
	| 	//ДляБухУчета ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	| 	//ДляБухУчета 	ЗатратыНаВыпускПродукцииНаработка.СуммаНУ
	| 	//ДляБухУчета ИНАЧЕ
	| 	//ДляБухУчета 	- ЗатратыНаВыпускПродукцииНаработка.СуммаНУ
	| 	//ДляБухУчета КОНЕЦ КАК СтоимостьНУ,
	|	//ДляБухУчета 0 КАК СтоимостьНУНЗП,	
	|
	| 	//ДляБухУчета ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	| 	//ДляБухУчета 	ЗатратыНаВыпускПродукцииНаработка.НДСВходящий
	| 	//ДляБухУчета ИНАЧЕ
	| 	//ДляБухУчета 	- ЗатратыНаВыпускПродукцииНаработка.НДСВходящий
	| 	//ДляБухУчета КОНЕЦ КАК НДСВходящий,
	|	//ДляБухУчета 0 КАК НДСВходящийНЗП,
	|
	| 	//ДляБухУчета ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	| 	//ДляБухУчета 	ЗатратыНаВыпускПродукцииНаработка.НДСКредит
	| 	//ДляБухУчета ИНАЧЕ
	| 	//ДляБухУчета 	- ЗатратыНаВыпускПродукцииНаработка.НДСКредит
	| 	//ДляБухУчета КОНЕЦ КАК НДСКредит,
	|	//ДляБухУчета 0 КАК НДСКредитНЗП,	
	|
	| 	0 КАК КоличествоНЗП,
	| 	0 КАК СтоимостьНЗП
	| ИЗ
	| 	РегистрНакопления.ЗатратыНаВыпускПродукцииНаработка%СуффиксУчета% КАК ЗатратыНаВыпускПродукцииНаработка
	| ГДЕ
	| 	ЗатратыНаВыпускПродукцииНаработка.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	| 	И ЗатратыНаВыпускПродукцииНаработка.Активность
	| 	И (НЕ ЗатратыНаВыпускПродукцииНаработка.КодОперации В (&МассивИсключаемыхКодовОперацийЗатратыНаВыпускПродукции))
	| 	И &УчитыватьНаработку
	| {ГДЕ
	| 	//ДляРеглУчета ЗатратыНаВыпускПродукцииНаработка.Организация.* КАК Организация,
	| 	//ДляРеглУчета ЗатратыНаВыпускПродукцииНаработка.СчетУчета.* КАК СчетУчета,
	| 	//ДляБухУчета  ЗатратыНаВыпускПродукцииНаработка.НалоговоеНазначениеПоФакту.* КАК НалоговоеНазначениеПоФакту,
	| 	ЗатратыНаВыпускПродукцииНаработка.СтатьяЗатрат.* КАК СтатьяЗатрат,
	| 	ЗатратыНаВыпускПродукцииНаработка.Затрата.* КАК Затрата,
	| 	ЗатратыНаВыпускПродукцииНаработка.ХарактеристикаЗатраты.* КАК ХарактеристикаЗатраты,
	| 	ЗатратыНаВыпускПродукцииНаработка.СерияЗатраты.* КАК СерияЗатраты,
	| 	ЗатратыНаВыпускПродукцииНаработка.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	| 	Подразделение.* КАК Подразделение,
	| 	ЗатратыНаВыпускПродукцииНаработка.Продукция.* КАК Продукция,
	| 	ЗатратыНаВыпускПродукцииНаработка.ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	| 	ЗатратыНаВыпускПродукцииНаработка.Заказ.* КАК Заказ
	| }	
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|
	| ВЫБРАТЬ
	| 	//ДляРеглУчета ЗатратыНаВыпускПродукцииНаработка.Организация,
	| 	//ДляРеглУчета ЗатратыНаВыпускПродукцииНаработка.СчетУчета КАК СчетУчета,
	| 	//ДляБухУчета  ЗатратыНаВыпускПродукцииНаработка.НалоговоеНазначениеПоФакту КАК НалоговоеНазначениеПоФакту,
	| 	ЗатратыНаВыпускПродукцииНаработка.СтатьяЗатрат,
	| 	ЗатратыНаВыпускПродукцииНаработка.СтатьяЗатрат.ВидЗатрат КАК ВидЗатрат,
	| 	ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.Затрата = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА
	| 		Неопределено
	| 	ИНАЧЕ
	| 		ЗатратыНаВыпускПродукцииНаработка.Затрата
	| 	КОНЕЦ КАК Затрата,
	| 	ЗатратыНаВыпускПродукцииНаработка.ХарактеристикаЗатраты,
	| 	ЗатратыНаВыпускПродукцииНаработка.СерияЗатраты,
	| 	ЗатратыНаВыпускПродукцииНаработка.НоменклатурнаяГруппаНЗП КАК НоменклатурнаяГруппа,
	| 
	| 	ВЫБОР КОГДА ЗатратыНаВыпускПродукцииНаработка.ПодразделениеНЗП =
	| 		//ДляУпрУчета ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	| 		//ДляРеглУчета ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	| 	ТОГДА
	| 		ЗатратыНаВыпускПродукцииНаработка.Подразделение
	| 	ИНАЧЕ
	| 		ЗатратыНаВыпускПродукцииНаработка.ПодразделениеНЗП
	| 	КОНЕЦ КАК Подразделение,
	|
	| 	ЗатратыНаВыпускПродукцииНаработка.Продукция,
	| 	ЗатратыНаВыпускПродукцииНаработка.ХарактеристикаПродукции,
	| 	NULL КАК СерияПродукции,
	| 	NULL КАК Спецификация,
	| 	ЗатратыНаВыпускПродукцииНаработка.ЗаказНЗП КАК Заказ,
	| 	NULL КАК Регистратор,
	| 	ЗатратыНаВыпускПродукцииНаработка.КоличествоНачальныйОстаток КАК Количество,
	| 	ЗатратыНаВыпускПродукцииНаработка.СуммаНачальныйОстаток КАК Стоимость,
	| 	//ДляБухУчета ЗатратыНаВыпускПродукцииНаработка.СуммаНУНачальныйОстаток КАК СтоимостьНУ,
	|	//ДляБухУчета 0 КАК СтоимостьНУНЗП,	
	|
	| 	//ДляБухУчета ЗатратыНаВыпускПродукцииНаработка.НДСВходящийНачальныйОстаток КАК НДСВходящий,
	|	//ДляБухУчета 0 КАК НДСВходящийНЗП,
	|
	| 	//ДляБухУчета ЗатратыНаВыпускПродукцииНаработка.НДСКредитНачальныйОстаток КАК НДСКредит,
	|	//ДляБухУчета 0 КАК НДСКредитНЗП,	
	|
	| 	0 КАК КоличествоНЗП,
	| 	0 КАК СтоимостьНЗП
	| ИЗ
	| 	РегистрНакопления.ЗатратыНаВыпускПродукцииНаработка%СуффиксУчета%.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Период, ,
	| 		&УчитыватьНаработку
	| 		{
	| 		//ДляРеглУчета Организация.* КАК Организация,
	| 		//ДляРеглУчета СчетУчета.* КАК СчетУчета,
	| 		//ДляБухУчета  НалоговоеНазначениеПоФакту.* КАК НалоговоеНазначениеПоФакту,
	| 		СтатьяЗатрат.* КАК СтатьяЗатрат,
	| 		Затрата.* КАК Затрата,
	| 		ХарактеристикаЗатраты.* КАК ХарактеристикаЗатраты,
	| 		СерияЗатраты.* КАК СерияЗатраты,
	| 		НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	| 		Продукция.* КАК Продукция,
	| 		ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	| 		Заказ.* КАК Заказ
	| 		}	
	| 	)КАК ЗатратыНаВыпускПродукцииНаработка
	| {ГДЕ
	| 	Подразделение.* КАК Подразделение
	| }	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	//ДляРеглУчета НезавершенноеПроизводствоОстатки.Организация,
	|	//ДляРеглУчета НезавершенноеПроизводствоОстатки.СчетУчета,
	|	//ДляБухУчета  НезавершенноеПроизводствоОстатки.НалоговоеНазначение,
	|	НезавершенноеПроизводствоОстатки.СтатьяЗатрат,
	|	НезавершенноеПроизводствоОстатки.СтатьяЗатрат.ВидЗатрат КАК ВидЗатрат,
	|	НезавершенноеПроизводствоОстатки.Затрата,
	|	НезавершенноеПроизводствоОстатки.ХарактеристикаЗатраты,
	|	НезавершенноеПроизводствоОстатки.СерияЗатраты,
	|	НезавершенноеПроизводствоОстатки.НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОстатки.Подразделение,
	|	NULL КАК Продукция,
	|	NULL КАК ХарактеристикаПродукции,
	|	NULL КАК СерияПродукции,
	|	NULL КАК Спецификация,
	|	НезавершенноеПроизводствоОстатки.Заказ КАК Заказ,
	|	NULL КАК Регистратор,
	|	0 КАК Количество,
	|	0 КАК Стоимость,
 	|	//ДляБухУчета 0 КАК СтоимостьНУ,	
	|	//ДляБухУчета НезавершенноеПроизводствоОстатки.СтоимостьНУНачальныйОстаток КАК СтоимостьНУНЗП,	
	|	//ДляБухУчета 0 КАК НДСВходящий,	
	|	//ДляБухУчета НезавершенноеПроизводствоОстатки.НДСВходящийНачальныйОстаток КАК НДСВходящийНЗП,
	|	//ДляБухУчета 0 КАК НДСКредит,	
	|	//ДляБухУчета НезавершенноеПроизводствоОстатки.НДСКредитНачальныйОстаток КАК НДСКредитНЗП,
	|	НезавершенноеПроизводствоОстатки.КоличествоНачальныйОстаток КАК КоличествоНЗП,
	|	НезавершенноеПроизводствоОстатки.СтоимостьНачальныйОстаток КАК СтоимостьНЗП
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводство%СуффиксУчета%.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Период, ,
	|		{
	|		//ДляРеглУчета Организация.* КАК Организация, 
	|		//ДляРеглУчета СчетУчета.* КАК СчетУчета, 
	|		//ДляБухУчета  НалоговоеНазначение.* КАК НалоговоеНазначениеПоФакту, 
	|		СтатьяЗатрат.* 			КАК СтатьяЗатрат, 
	|		Затрата.* 				КАК Затрата, 
	|		ХарактеристикаЗатраты.* КАК ХарактеристикаЗатраты, 
	|		СерияЗатраты.* 			КАК СерияЗатраты, 
	|		НоменклатурнаяГруппа.* 	КАК НоменклатурнаяГруппа, 
	|		Подразделение.* 		КАК Подразделение, 
	|		Заказ.* КАК Заказ
	|		}
	|	) КАК НезавершенноеПроизводствоОстатки
	|			
	|ОБЪЕДИНИТЬ ВСЕ
	|			
	|ВЫБРАТЬ
	|	//ДляРеглУчета НезавершенноеПроизводство.Организация,
	|	//ДляРеглУчета НезавершенноеПроизводство.СчетУчета,
	|	//ДляБухУчета  НезавершенноеПроизводство.НалоговоеНазначение,
	|	НезавершенноеПроизводство.СтатьяЗатрат,
	|	НезавершенноеПроизводство.СтатьяЗатрат.ВидЗатрат КАК ВидЗатрат,
	|	НезавершенноеПроизводство.Затрата,
	|	НезавершенноеПроизводство.ХарактеристикаЗатраты,
	|	НезавершенноеПроизводство.СерияЗатраты,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа,
	|	НезавершенноеПроизводство.Подразделение,
	|	NULL КАК Продукция,
	|	NULL КАК ХарактеристикаПродукции,
	|	NULL КАК СерияПродукции,
	|	NULL КАК Спецификация,
	|	НезавершенноеПроизводство.Заказ КАК Заказ,
	|	НезавершенноеПроизводство.Регистратор КАК Регистратор,
	|	0 КАК Количество,
	|	0 КАК Стоимость,
	|	//ДляБухУчета 0 КАК СтоимостьНУ,	
	|	//ДляБухУчета ВЫБОР
	|	//ДляБухУчета 	КОГДА НезавершенноеПроизводство.ВидДвижения = &Приход
	|	//ДляБухУчета 		ТОГДА НезавершенноеПроизводство.СтоимостьНУ
	|	//ДляБухУчета 	ИНАЧЕ ВЫБОР
	|	//ДляБухУчета 			КОГДА НезавершенноеПроизводство.КодОперации В (&МассивИсключаемыхКодовОперацийНЗП)
	|	//ДляБухУчета 				ТОГДА -НезавершенноеПроизводство.СтоимостьНУ
	|	//ДляБухУчета 			ИНАЧЕ 0
	|	//ДляБухУчета 		КОНЕЦ
	|	//ДляБухУчета КОНЕЦ КАК СтоимостьНУНЗП,
	|
	|	//ДляБухУчета 0 КАК НДСВходящий,	
	|	//ДляБухУчета ВЫБОР
	|	//ДляБухУчета 	КОГДА НезавершенноеПроизводство.ВидДвижения = &Приход
	|	//ДляБухУчета 		ТОГДА НезавершенноеПроизводство.НДСВходящий
	|	//ДляБухУчета 	ИНАЧЕ ВЫБОР
	|	//ДляБухУчета 			КОГДА НезавершенноеПроизводство.КодОперации В (&МассивИсключаемыхКодовОперацийНЗП)
	|	//ДляБухУчета 				ТОГДА -НезавершенноеПроизводство.НДСВходящий
	|	//ДляБухУчета 			ИНАЧЕ 0
	|	//ДляБухУчета 		КОНЕЦ
	|	//ДляБухУчета КОНЕЦ КАК НДСВходящийНЗП,
	|
	|	//ДляБухУчета 0 КАК НДСКредит,	
	|	//ДляБухУчета ВЫБОР
	|	//ДляБухУчета 	КОГДА НезавершенноеПроизводство.ВидДвижения = &Приход
	|	//ДляБухУчета 		ТОГДА НезавершенноеПроизводство.НДСКредит
	|	//ДляБухУчета 	ИНАЧЕ ВЫБОР
	|	//ДляБухУчета 			КОГДА НезавершенноеПроизводство.КодОперации В (&МассивИсключаемыхКодовОперацийНЗП)
	|	//ДляБухУчета 				ТОГДА -НезавершенноеПроизводство.НДСКредит
	|	//ДляБухУчета 			ИНАЧЕ 0
	|	//ДляБухУчета 		КОНЕЦ
	|	//ДляБухУчета КОНЕЦ КАК НДСКредитНЗП,
	|
	|	ВЫБОР
	|		КОГДА НезавершенноеПроизводство.ВидДвижения = &Приход
	|			ТОГДА НезавершенноеПроизводство.Количество
	|		ИНАЧЕ 
	|			ВЫБОР КОГДА НезавершенноеПроизводство.КодОперации В (&МассивИсключаемыхКодовОперацийНЗП)
	|				И Не НезавершенноеПроизводство.Затрата ССЫЛКА Перечисление.ХарактерЗатрат
	|			ТОГДА
	|				-НезавершенноеПроизводство.Количество
	|			ИНАЧЕ
	|				0
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоНЗП,
	|	ВЫБОР
	|		КОГДА НезавершенноеПроизводство.ВидДвижения = &Приход
	|			ТОГДА НезавершенноеПроизводство.Стоимость
	|		ИНАЧЕ
	|			ВЫБОР КОГДА НезавершенноеПроизводство.КодОперации В (&МассивИсключаемыхКодовОперацийНЗП)
	|				И Не НезавершенноеПроизводство.Затрата ССЫЛКА Перечисление.ХарактерЗатрат
	|			ТОГДА
	|				-НезавершенноеПроизводство.Стоимость
	|			ИНАЧЕ
	|				0
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьНЗП
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводство%СуффиксУчета% КАК НезавершенноеПроизводство
	|ГДЕ
	|	НезавершенноеПроизводство.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И НезавершенноеПроизводство.Активность
	|{ГДЕ
	|	//ДляРеглУчета НезавершенноеПроизводство.Организация.* КАК Организация,
	|	//ДляРеглУчета НезавершенноеПроизводство.СчетУчета.* КАК СчетУчета,
	|	//ДляБухУчета НезавершенноеПроизводство.НалоговоеНазначение.* КАК НалоговоеНазначениеПоФакту,
	|	НезавершенноеПроизводство.СтатьяЗатрат.* 			КАК СтатьяЗатрат,
	|	НезавершенноеПроизводство.Затрата.* 				КАК Затрата,
	|	НезавершенноеПроизводство.ХарактеристикаЗатраты.* 	КАК ХарактеристикаЗатраты,
	|	НезавершенноеПроизводство.СерияЗатраты.* 			КАК СерияЗатраты,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа.* 	КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводство.Подразделение.* 			КАК Подразделение,
	|	НезавершенноеПроизводство.Заказ.* КАК Заказ
	|}
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	//ДляРеглУчета ВложенныйЗапрос.Организация,
	|	//ДляРеглУчета ВложенныйЗапрос.СчетУчета,
	|	//ДляБухУчета  ВложенныйЗапрос.НалоговоеНазначениеПоФакту,
	|
	|	ВЫБОР КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщепроизводственныеРасходы) ТОГДА
	|		ЕСТЬNULL(УчетнаяПолитика.СтатьяОбщепроизводственныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|	//ДляУпрУчета КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.АдминистративныеРасходы) ТОГДА
	|	//ДляУпрУчета	ЕСТЬNULL(УчетнаяПолитика.СтатьяАдминистративныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|	КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.БракВПроизводстве) ТОГДА
	|		ЕСТЬNULL(УчетнаяПолитика.СтатьяБракВПроизводстве, ВложенныйЗапрос.СтатьяЗатрат)
	|	ИНАЧЕ
	|   	ВложенныйЗапрос.СтатьяЗатрат
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	
	|	ВЫБОР КОГДА ВложенныйЗапрос.Затрата ССЫЛКА Перечисление.ХарактерЗатрат ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.Прочие)
	|	ИНАЧЕ
	|   	ВложенныйЗапрос.ВидЗатрат
	|	КОНЕЦ КАК ВидЗатрат,
	|
	|	ВложенныйЗапрос.Затрата,
	|	ВложенныйЗапрос.ХарактеристикаЗатраты,
	|	ВложенныйЗапрос.СерияЗатраты,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.Продукция,
	|	ВложенныйЗапрос.ХарактеристикаПродукции,
	|	ВложенныйЗапрос.СерияПродукции,
	|	ВложенныйЗапрос.Спецификация,
	|	ВложенныйЗапрос.Заказ,
	|	ВложенныйЗапрос.Регистратор,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	|	СУММА(ВложенныйЗапрос.КоличествоНЗП) КАК КоличествоНЗП,
	|	СУММА(ВложенныйЗапрос.СтоимостьНЗП) КАК СтоимостьНЗП,
	|	//ДляБухУчета СУММА(ВложенныйЗапрос.СтоимостьНУ) КАК СтоимостьНУ,	
	|	//ДляБухУчета СУММА(ВложенныйЗапрос.СтоимостьНУНЗП) КАК СтоимостьНУНЗП,
	|	//ДляБухУчета СУММА(ВложенныйЗапрос.НДСВходящий) КАК НДСВходящий,	
	|	//ДляБухУчета СУММА(ВложенныйЗапрос.НДСВходящийНЗП) КАК НДСВходящийНЗП,
	|	//ДляБухУчета СУММА(ВложенныйЗапрос.НДСКредит) КАК НДСКредит,	
	|	//ДляБухУчета СУММА(ВложенныйЗапрос.НДСКредитНЗП) КАК НДСКредитНЗП,	
	|	//ДляРеглУчета ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
	|	//ДляРеглУчета ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СчетУчета) КАК СчетУчетаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(
	|		ВЫБОР КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщепроизводственныеРасходы) ТОГДА
	|			ЕСТЬNULL(УчетнаяПолитика.СтатьяОбщепроизводственныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|		//ДляУпрУчета КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.АдминистративныеРасходы) ТОГДА
	|		//ДляУпрУчета	ЕСТЬNULL(УчетнаяПолитика.СтатьяАдминистративныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|		КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.БракВПроизводстве) ТОГДА
	|			ЕСТЬNULL(УчетнаяПолитика.СтатьяБракВПроизводстве, ВложенныйЗапрос.СтатьяЗатрат)
	|		ИНАЧЕ
	|   		ВложенныйЗапрос.СтатьяЗатрат
	|		КОНЕЦ
	|	) КАК СтатьяЗатратПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Затрата) 					КАК ЗатратаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаЗатраты) 	КАК ХарактеристикаЗатратыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияЗатраты) 			КАК СерияЗатратыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.НоменклатурнаяГруппа) 	КАК НоменклатурнаяГруппаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) 			КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Продукция) 				КАК ПродукцияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаПродукции) 	КАК ХарактеристикаПродукцииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияПродукции) 			КАК СерияПродукцииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Спецификация) 			КАК СпецификацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Заказ) 					КАК ЗаказПредставление,
    |	//ДляБухУчета ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.НалоговоеНазначениеПоФакту) КАК НалоговоеНазначениеПоФактуПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) 				КАК РегистраторПредставление
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	//ДляРеглУчета Организация.*,
	|	//ДляРеглУчета СчетУчета.*,
    |	//ДляБухУчета НалоговоеНазначениеПоФакту.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	НоменклатурнаяГруппа.*,
	|	Подразделение.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	Регистратор.*,
	|	Количество,
	|	Стоимость,
	|	//ДляБухУчета СтоимостьНУ,	
	|	//ДляБухУчета СтоимостьНУНЗП,	
	|	//ДляБухУчета НДСВходящий,	
	|	//ДляБухУчета НДСВходящийНЗП,
	|	//ДляБухУчета НДСКредит,	
	|	//ДляБухУчета НДСКредитНЗП,
	|	КоличествоНЗП,
	|	СтоимостьНЗП
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	ПроизводственныеЗатраты КАК ВложенныйЗапрос
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		УчетнаяПолитика КАК УчетнаяПолитика
	|	ПО
	|		//ДляУпрУчета Истина ИЛИ УчетнаяПолитика.СтатьяОбщепроизводственныеРасходы = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|		//ДляРеглУчета ВложенныйЗапрос.Организация = УчетнаяПолитика.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	//ДляРеглУчета ВложенныйЗапрос.Организация,
	|	//ДляРеглУчета ВложенныйЗапрос.СчетУчета,
    |	//ДляБухУчета  ВложенныйЗапрос.НалоговоеНазначениеПоФакту,
	|	ВложенныйЗапрос.СерияПродукции,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа,
	|	ВложенныйЗапрос.СерияЗатраты,
	|	ВложенныйЗапрос.ХарактеристикаЗатраты,
	|	ВложенныйЗапрос.Затрата,
	|	ВЫБОР КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщепроизводственныеРасходы) ТОГДА
	|		ЕСТЬNULL(УчетнаяПолитика.СтатьяОбщепроизводственныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|	//ДляУпрУчета КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.АдминистративныеРасходы) ТОГДА
	|	//ДляУпрУчета	ЕСТЬNULL(УчетнаяПолитика.СтатьяАдминистративныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|	КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.БракВПроизводстве) ТОГДА
	|		ЕСТЬNULL(УчетнаяПолитика.СтатьяБракВПроизводстве, ВложенныйЗапрос.СтатьяЗатрат)
	|	ИНАЧЕ
	|   	ВложенныйЗапрос.СтатьяЗатрат
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ВложенныйЗапрос.Затрата ССЫЛКА Перечисление.ХарактерЗатрат ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.Прочие)
	|	ИНАЧЕ
	|   	ВложенныйЗапрос.ВидЗатрат
	|	КОНЕЦ,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.Продукция,
	|	ВложенныйЗапрос.ХарактеристикаПродукции,
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.Спецификация,
	|	ВложенныйЗапрос.Заказ,
	|	ПРЕДСТАВЛЕНИЕ(
	|		ВЫБОР КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.ОбщепроизводственныеРасходы) ТОГДА
	|			ЕСТЬNULL(УчетнаяПолитика.СтатьяОбщепроизводственныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|		//ДляУпрУчета КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.АдминистративныеРасходы) ТОГДА
	|		//ДляУпрУчета	ЕСТЬNULL(УчетнаяПолитика.СтатьяАдминистративныеРасходы, ВложенныйЗапрос.СтатьяЗатрат)
	|		КОГДА ВложенныйЗапрос.Затрата = ЗНАЧЕНИЕ(Перечисление.ХарактерЗатрат.БракВПроизводстве) ТОГДА
	|			ЕСТЬNULL(УчетнаяПолитика.СтатьяБракВПроизводстве, ВложенныйЗапрос.СтатьяЗатрат)
	|		ИНАЧЕ
	|   		ВложенныйЗапрос.СтатьяЗатрат
	|		КОНЕЦ
	|	),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Затрата),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаЗатраты),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияЗатраты),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.НоменклатурнаяГруппа),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Продукция),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаПродукции),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияПродукции),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Спецификация),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Заказ),
    |	//ДляБухУчета ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.НалоговоеНазначениеПоФакту),
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВложенныйЗапрос.Количество) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.Стоимость) <> 0
	|		//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.СтоимостьНУ) <> 0
	|		//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.СтоимостьНУНЗП) <> 0
	|		//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.НДСВходящий) <> 0
	|		//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.НДСВходящийНЗП) <> 0
	|		//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.НДСКредит) <> 0
	|		//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.НДСКредитНЗП) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.КоличествоНЗП) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СтоимостьНЗП) <> 0) И
	|	((НЕ &ТолькоРасхождение)
	|		ИЛИ &ТолькоРасхождение
	|			И (СУММА(ВложенныйЗапрос.Количество) <> СУММА(ВложенныйЗапрос.КоличествоНЗП)
	|				ИЛИ СУММА(ВложенныйЗапрос.Количество) = 0
	|					И СУММА(ВложенныйЗапрос.КоличествоНЗП) = 0
	|					И (СУММА(ВложенныйЗапрос.Стоимость) <> СУММА(ВложенныйЗапрос.СтоимостьНЗП)
	|					//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.СтоимостьНУ) <> СУММА(ВложенныйЗапрос.СтоимостьНУНЗП)
	|					//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.НДСВходящий) <> СУММА(ВложенныйЗапрос.НДСВходящийНЗП)
	|					//ДляБухУчета ИЛИ СУММА(ВложенныйЗапрос.НДСКредит) <> СУММА(ВложенныйЗапрос.НДСКредитНЗП)
	|                   )))
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.Стоимость,
	|	//ДляБухУчета ВложенныйЗапрос.СтоимостьНУ,
	|	//ДляБухУчета ВложенныйЗапрос.СтоимостьНУНЗП,	
	|	//ДляБухУчета ВложенныйЗапрос.НДСВходящий,	
	|	//ДляБухУчета ВложенныйЗапрос.НДСВходящийНЗП,
	|	//ДляБухУчета ВложенныйЗапрос.НДСКредит,	
	|	//ДляБухУчета ВложенныйЗапрос.НДСКредитНЗП,	
	|	ВложенныйЗапрос.КоличествоНЗП,
	|	ВложенныйЗапрос.СтоимостьНЗП
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	//ДляРеглУчета Организация.*,
	|	//ДляРеглУчета СчетУчета.*,
    |	//ДляБухУчета  НалоговоеНазначениеПоФакту.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	НоменклатурнаяГруппа.*,
	|	Подразделение.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	Регистратор.*,
	|	Количество,
	|	Стоимость,
	|	//ДляБухУчета СтоимостьНУ,	
	|	//ДляБухУчета СтоимостьНУНЗП,	
	|	//ДляБухУчета НДСВходящий,	
	|	//ДляБухУчета НДСВходящийНЗП,
	|	//ДляБухУчета НДСКредит,	
	|	//ДляБухУчета НДСКредитНЗП,	
	|	КоличествоНЗП,
	|	СтоимостьНЗП
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Стоимость),
	|	//ДляБухУчета СУММА(СтоимостьНУ),	
	|	//ДляБухУчета СУММА(СтоимостьНУНЗП),	
	|	//ДляБухУчета СУММА(НДСВходящий),	
	|	//ДляБухУчета СУММА(НДСВходящийНЗП),
	|	//ДляБухУчета СУММА(НДСКредит),	
	|	//ДляБухУчета СУММА(НДСКредитНЗП),	
	|	СУММА(КоличествоНЗП),
	|	СУММА(СтоимостьНЗП)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	//ДляРеглУчета Организация.*,
	|	//ДляРеглУчета СчетУчета.*,
    |	//ДляБухУчета  НалоговоеНазначениеПоФакту.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	НоменклатурнаяГруппа.*,
	|	Подразделение.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	Регистратор.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Организация", 			"Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("НоменклатурнаяГруппа", 	"НоменклатурнаяГруппа", "Номенклатурная группа", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_НоменклатурныеГруппы);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Продукция", 				"Продукция", "Продукция", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ХарактеристикаПродукции", "ХарактеристикаПродукции", "Характеристика продукции",   ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Затрата", 				"Затрата", "Затрата", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ХарактеристикаЗатраты", 	"ХарактеристикаЗатраты", "Характеристика затраты", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
	
	ТекстЗапроса = ЗаменитьКомментарииВТекстеЗапроса(ТекстЗапроса);
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	// Представления предопределенных полей запроса.
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", 			"Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетУчета", 				"Счет учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", 			"Статья затрат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Затрата", 				"Затрата");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаЗатраты", 	"Характеристика затраты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияЗатраты", 			"Серия затраты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", 	"Номенклатурная группа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", 			"Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Продукция", 				"Продукция");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаПродукции", "Характеристика продукции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияПродукции", 			"Серия продукции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Спецификация", 			"Спецификация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Заказ", 					"Заказ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НалоговоеНазначениеПоФакту",		"Налоговое назначение");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", 				"Количество");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость", 				"Стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоНЗП", 			"Количество НЗП");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьНЗП", 			"Стоимость НЗП");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьНУ", 	"Стоимость (НУ)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьНУНЗП", 	"Стоимость (НУ) НЗП");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСВходящий", 	"НДС входящий");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСВходящийНЗП", 	"НДС входящий НЗП");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСКредит", 		"НДС кредит");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСКредитНЗП", 	"НДС кредит НЗП");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", 	"Количество", Истина, "ЧЦ=15; ЧДЦ=3", , );
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", 		"Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", , );
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНЗП", 	"Количество НЗП", Истина, "ЧЦ=15; ЧДЦ=3", , );
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьНЗП", 	"Стоимость НЗП", Истина, "ЧЦ=15; ЧДЦ=2", , );
	
	Если ВидУчета = 1 Тогда
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьНУ", 	"Стоимость (НУ)", Истина, "ЧЦ=15; ЧДЦ=2", , );
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьНУНЗП", "Стоимость (НУ) НЗП", Истина, "ЧЦ=15; ЧДЦ=2", , );
		УниверсальныйОтчет.ДобавитьПоказатель("НДСВходящий", 	"НДС входящий", Истина, "ЧЦ=15; ЧДЦ=2", , );
		УниверсальныйОтчет.ДобавитьПоказатель("НДСВходящийНЗП", "НДС входящий НЗП", Истина, "ЧЦ=15; ЧДЦ=2", , );
		УниверсальныйОтчет.ДобавитьПоказатель("НДСКредит", 		"НДС кредит", Истина, "ЧЦ=15; ЧДЦ=2", , );
		УниверсальныйОтчет.ДобавитьПоказатель("НДСКредитНЗП", 	"НДС кредит НЗП", Истина, "ЧЦ=15; ЧДЦ=2", , );
	КонецЕсли; 
	
	
	// Добавление предопредедленных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяЗатрат");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Затрата");
	
	// Добавление предопредедленных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопредедленных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("СтатьяЗатрат");
	УниверсальныйОтчет.ДобавитьОтбор("Затрата");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УниверсальныйОтчет.ДатаНач) Тогда
		#Если Клиент Тогда
			Сообщить("Без указания начальной даты данные отчета могут быть неверные!");
		#КонецЕсли
	КонецЕсли; 
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("МатЗатраты", Перечисления.ВидыЗатрат.Материальные);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТолькоРасхождение", ПоказыватьТолькоРасхождение);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("УчитыватьНаработку", УчитыватьНаработку);
	
	МассивКодовОперацииНезавершенноеПроизводство = Новый Массив;
	МассивКодовОперацииНезавершенноеПроизводство.Добавить(Перечисления.КодыОперацийНезавершенноеПроизводство.ВозвратМатериаловИзПроизводстваФикс);
	МассивКодовОперацииНезавершенноеПроизводство.Добавить(Перечисления.КодыОперацийНезавершенноеПроизводство.ОприходованиеНЗПФикс);
	МассивКодовОперацииНезавершенноеПроизводство.Добавить(Перечисления.КодыОперацийНезавершенноеПроизводство.КорректировкаНЗПФикс);
	МассивКодовОперацииНезавершенноеПроизводство.Добавить(Перечисления.КодыОперацийНезавершенноеПроизводство.РаспределениеНЗПРегламент);
	МассивКодовОперацииНезавершенноеПроизводство.Добавить(Перечисления.КодыОперацийНезавершенноеПроизводство.РаспределениеНЗППриИспользованииАналитикиНЗП);
	
	МассивКодовОперацииЗатратыНаВыпускПродукции = Новый Массив;
	МассивКодовОперацииЗатратыНаВыпускПродукции.Добавить(Перечисления.КодыОперацийЗатратыНаВыпускПродукции.ОприходованиеНЗП);
	МассивКодовОперацииЗатратыНаВыпускПродукции.Добавить(Перечисления.КодыОперацийЗатратыНаВыпускПродукции.КорректировкаНЗПРасч);
    МассивКодовОперацииЗатратыНаВыпускПродукции.Добавить(Перечисления.КодыОперацийЗатратыНаВыпускПродукции.КорректировкаНЗПФикс);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("МассивИсключаемыхКодовОперацийНЗП", МассивКодовОперацииНезавершенноеПроизводство);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("МассивИсключаемыхКодовОперацийЗатратыНаВыпускПродукции", МассивКодовОперацииЗатратыНаВыпускПродукции);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Приход", ВидДвиженияНакопления.Приход);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	ТекстСправкиФормы = "";
	
	Если глЗначениеПеременной("ИспользоватьРасширеннуюАналитикуУчетаНоменклатурыИЗатрат") Тогда
		НачалоИспользования = Формат(глЗначениеПеременной("ДатаНачалаИспользованияРасширеннойАналитикиУчетаНоменклатурыИЗатрат"), "ДФ=dd.MM.yyyy");
		
		ТекстСправкиФормы = "<P>С " + НачалоИспользования + " установлено использование расширенной аналитики учета затрат."
					+ "<BR><b>Использование отчета для расширенной аналитики не поддерживается<b>.<P>";
	КонецЕсли; 
	
	Возврат ТекстСправкиФормы;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
